In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [25]:
arr = np.arange(36).reshape(6,6)
np.random.shuffle(arr)
DF_obj = pd.DataFrame(arr)
DF_obj

    0   1   2   3   4   5
0  18  19  20  21  22  23
1  12  13  14  15  16  17
2  24  25  26  27  28  29
3  30  31  32  33  34  35
4   0   1   2   3   4   5
5   6   7   8   9  10  11

In [4]:
series_obj_1 = pd.Series([42,3,4,18,11,65])

In [28]:
series_obj_1.sort_values(ascending=False)

5    65
0    42
3    18
4    11
2     4
1     3
dtype: int64

In [5]:
series_obj_2 = pd.Series(['z','A','a','Z','Text','T','text'])

In [33]:
series_obj_2.sort_values(ascending=True)

1       A
5       T
4    Text
3       Z
2       a
6    text
0       z
dtype: object

In [36]:
DF_obj.sort_values(by=[1], ascending=False)

    0   1   2   3   4   5
3  30  31  32  33  34  35
2  24  25  26  27  28  29
0  18  19  20  21  22  23
1  12  13  14  15  16  17
5   6   7   8   9  10  11
4   0   1   2   3   4   5